Repository: theirix/hgate
Catalog: hgate/locale/*/LC_MESSAGES/django.po
Languages: ru_ru

source: Configuration file was changed, please try again.
ru_ru: Файл конфигурации был изменён, попробуйте ещё раз.

source: Group '%s' was deleted successfully.
ru_ru: Группа '%s' успешно удалена.

source: Login
ru_ru: Логин

source: Password
ru_ru: Пароль

source: Re-enter password
ru_ru: Повторите пароль

source: Passwords should be the same
ru_ru: Пароли должны быть одинаковыми

source: User exists
ru_ru: Пользователь существует

source: Don`t use special characters any of *:?/\ or names '.' and '..'
ru_ru: Не используйте специальные символы: *:?/\, а так же имена '.' и '..'

source: Repository name
ru_ru: Имя репозитория

source: Group
ru_ru: Группа

source: New repository was created.
ru_ru: Создан новый репозиторий.

source: Repository '%(repo)s' was not moved to the same location: %(location)s.
ru_ru: Репозиторий [%(repo)s] не переименован, причина: то же имя %(location)s.

source: Repository '%(old_path)s' moved by path '%(new_path)s' successfully.
ru_ru: Репозиторий [%(old_path)s] успешно переименован в [%(new_path)s].

source: Repository '%(repo)s' was not moved: %(cause)s.
ru_ru: Репозиторий [%(repo)s] не переименован, причина: %(cause)s

source: Group name
ru_ru: Имя группы

source: Path
ru_ru: Путь

source: Path should be ended with /* or /**
ru_ru: Путь должен заканчиваться на /* или /**

source: The path is already defined by group: %s
ru_ru: Данный путь уже определён для группы: %s

source: New group was added.
ru_ru: Новая группа добавлена.

source: Group was not created: %s
ru_ru: Группа не создана: %s

source: Group '%s' was changed.
ru_ru: Группа '%s' изменена.

source: There is already a group with such a name. Group '%s' wasn`t changed.
ru_ru: Уже существует группа с таким именем. Группа '%s' не изменена.

source: Can't load config file
ru_ru: Не могу загрузить файл конфигурации

source: Can't create config file
ru_ru: Не могу создать файл конфигурации

source: There is a problem while deleting group: %s
ru_ru: При удалении группы произошла ошибка: %s

source: There is already a group with such a name.
ru_ru: Уже существует группа с таким именем.

source: There is already such a repository.
ru_ru: Уже существует такой репозиторий.

source: Repository [%(path)s] is not created, because of error: %(cause)s
ru_ru: Репозиторий [%(path)s] не создан, причина: %(cause)s

source: There is no repository by path: [%s]
ru_ru: Нет репозитория по пути: [%s]

source: Failed to delete [%(path)s], because of error: %(cause)s
ru_ru: Ошибка при удалении [%(path)s], причина: %(cause)s

source: There is file by path: [%s]
ru_ru: Нет репозитория по пути: [%s]

source: There is no access rights by path: [%s]
ru_ru: Недостаточно прав по пути: [%s]

source: Repository [%(old_path)s] is not moved to [%(new_path)s], because of error: %(cause)s
ru_ru: Репозиторий [%(old_path)s] не переименован в [%(new_path)s], причина: %(cause)s

source: Invalid repository name.
ru_ru: Недопустимое имя репозитория

source: Main configuration file does not exist by specified path:
ru_ru: Главный конфигурационный файл не существует по указанному пути:

source: No access to read or write mercurial`s global configuration file by path:
ru_ru: Нет прав на чтение или запись файла глобальной конфигурации mercurial`а по пути:

source: Root directory of repositories does not exist by path:
ru_ru: Корневая директория для репозиториев не существует:

source: No read or execute access to the root directory of repositories by path:
ru_ru: Нет прав на чтение или выполнение корневой директории:

source: No users file or no read access by path:
ru_ru: Нет файла users или прав на чтение по пути:

source: Global settings saved successfully.
ru_ru: Глабальные настройки успешно сохранены.

source: Repository settings saved successfully.
ru_ru: Настройки репозитория успешно сохранены.

source: Repository '%s' deleted successfully.
ru_ru: Репозиторий '%s' успешно удалён.

source: Repository '%(repo)s' was not deleted, cause: %(cause).
ru_ru: Репозиторий [%(repo)s] не удалён, причина: %(cause)s

source: No hgrc for this repository. No write access to create hgrc by path:
ru_ru: Нет hgrc для данного репозитория. Нет прав на запись для создания hgrc по пути:

source: No access to write mercurial`s local configuration file by path:
ru_ru: Нет прав на запись локального конфигурационного файла mercirial`а по пути:

source: No access to read mercurial`s local configuration file by path:
ru_ru: Нет прав на чтение локального конфигурационного файла mercirial`а по пути:

source: User '%s' was deleted.
ru_ru: Пользователь '%s' удалён.

source: User '%s' was added.
ru_ru: Пользователь '%s' добавлен.

source: Password changed successfully.
ru_ru: Пароль успешно изменён.

source: No write access for users file by path:
ru_ru: Нет прав на запись файла users по пути:

source: Home
ru_ru: Главная

source: Users
ru_ru: Пользователи

source: HgWeb
ru_ru: Настройки HgWeb

source: Help
ru_ru: Помощь

source: Repository
ru_ru: Репозиторий

source: Fix the above problem
ru_ru: Исправьте высшеописанную проблему

source: to continue work!
ru_ru: для продолжения работы!

source: Are you sure you want to delete group
ru_ru: Вы уверены, что хотите удалить группу

source: The path is already defined by group
ru_ru: Данный путь уже определён для группы

source: ', delete content of the group?
ru_ru: ', удалить содержимое группы?

source: repositories
ru_ru: репозиториев

source: repository
ru_ru: репозиторий

source: This group is not empty.\n It has
ru_ru: Эта группа не пуста.\n Она содержит

source: Delete anyway
ru_ru: Удалить в любом случае?

source: cancel
ru_ru: отменить

source: save
ru_ru: сохранить

source: Create repository
ru_ru: Создать репозиторий

source: Create
ru_ru: Создать

source: Create new repository : Path: default path (%(default_path)s) if no group is specified or concrete group path.<br>Name: specified name.<br>This action creates dir with repository name and makes &apos;hg init&apos; in that dir.
ru_ru: Создать новый репозиторий : Путь: путь по-умолчанию (%(default_path)s), если не указана группа или путь выбранной группы.<br>Имя: указанное имя.<br>Это действие создаёт директорию с именем репозитория и выполняет &apos;hg init&apos; в ней.

source: Manage groups
ru_ru: Управление группами

source: Collection
ru_ru: Коллекция

source: Create new group : Creates all missing directories in the group path.<br>Adds record about this group to the hgweb.config.
ru_ru: Создание новой группы : Создаёт необходимые директории, если необходимо, для пути группы.<br>Добавляет запись об этой группе в hgweb.config.

source: Type
ru_ru: Тип

source: Full path
ru_ru: Абсолютный путь

source: Action
ru_ru: Действие

source: Click to start editing this group: you can change name and path.
ru_ru: Клик для начала редактирования данной группы: вы можете изменить имя и путь.

source: edit
ru_ru: редактировать

source: Delete the group: removes record about this group from hgweb.config. Deletes group`s dir and all it`s subdirectories.
ru_ru: Удалить группу : удаляет запись об это группе из hgweb.config. Удаляетдиректорию группы и всё её содержимое.

source: delete
ru_ru: удалить

source: Are you sure you want to delete parameter
ru_ru: Вы уверены, что хотите удалить параметр

source: from hgrc file
ru_ru: из файла hgrc

source: Advanced mode
ru_ru: Продвинутый режим редактирования

source: Raw mode
ru_ru: Редактирование конфигурации 'как есть'

source: Users :
ru_ru: Пользователи :

source: HgWeb config
ru_ru: HgWeb глобальная конфигурация

source: Additional actions
ru_ru: Дополнительно

source: Change repository:
ru_ru: Изменить репозиторий:

source: Change repository : Allows to change repository name, move it between groups and default repository directory.
ru_ru: Изменить репозиторий : Позволяет переименовать репозиторий, переместить его в группу или директорию по-умолчанию.

source: Save
ru_ru: Сохранить

source: Delete repository:
ru_ru: Удалить репозиторий:

source: Delete repository : Deletes directory tree and modifies hgweb.config if this is single path item.
ru_ru: Удалить репозиторий : Удаляет директорию с репозиторием и всем его содержимым, удаляет запись из hgweb.config, если репозиторий не группа.

source: Are you sure?
ru_ru: Вы уверены?

source: Delete
ru_ru: удалить

source: Remove:
ru_ru: Удалить:

source: Add:
ru_ru: Добавить:

source: Delete parameter : remove this parameter from the local hgrc file
ru_ru: Удалить параметр : удаляет этот параметр из hgrc файла данного репозитория

source: Edit
ru_ru: Редактировать

source: Cancel
ru_ru: Отменить

source: Editor
ru_ru: Редактор

source: Save global configuration : Modifies [web] section in the hgweb.config.
ru_ru: Сохраняет глобальную конфигурацию : Изменяеи секцию [web] в файле hgweb.config.

source: Save repository configuration : Modifies [web] section of the hgrc of the repository.
ru_ru: Сохраняет настройки репозитория : Изменяет секцию [web] файла hgrc репозитория

source: Value is set in the local hgrc file
ru_ru: Значение установлено в локальном hgrc файле

source: Value is set in the hgweb config
ru_ru: Значение установлено в файле настроек hgweb

source: Value not set in any config
ru_ru: Значение не установлено ни в одном файле настроек

source: Value not set in hgweb config
ru_ru: Значение не установлено в файле настроек hgweb

source: << Back to users list
ru_ru: << Назад к списку пользователей

source: User
ru_ru: Пользователь

source: Change password
ru_ru: Изменить пароль

source: Change passwrod : Modifies users file, changes password for the user.
ru_ru: Изменяет пароль : Изменяеи файл users, изменяеи пароль пользователя.

source: Permissions
ru_ru: Права

source: Read
ru_ru: Читать

source: Push
ru_ru: Писать

source: User does not have any permissions.
ru_ru: У пользователья нет прав на чтение/запись.

source: Delete user
ru_ru: Удалить пользователя

source: Create user
ru_ru: Создать пользователя

source: Add new user : Modifies users file, adds line user_name:crypted_password.
ru_ru: Дабавление нового пользователя : Изменяет файл users, добавляет запись вида имя_пользователя:зашифрованный_пароль.

source: Manage users
ru_ru: Управление пользователями

source: Change password and manage user's permissions
ru_ru: Изменение пароля и управление правами пользователя

source: Remove user
ru_ru: Удалить пользователя
